Revit 2024 API
FabricationConnectorInfo.IsValid Method
 Checks if the connector has fabrication parameters associated with it that can be set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsValid()
Visual Basic
Public Function IsValid As Boolean
Visual C++
public:
bool IsValid()
Return Value
 True if the connector has fabrication parameters associated with it that can be set.
See Also
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace